Repository: mistertango-dev/module-woocommerce
Catalog: language/mistertango-woocommerce-*.po
Languages: lt_lt

source: WooCommerce Mistertango Payment
lt_lt: WooCommerce Mistertango mokėjimai

source: WooCommerce Mistertango Payment module
lt_lt: WooCommerce Mistertango mokėjimų modulis

source: Checkout
lt_lt: Apmokėti

source: Mister Tango Payment
lt_lt: Mistertango Mokėjimas

source: Click Here
lt_lt: spauskite čia

source: Payment information
lt_lt: Mokėjimo informacija

source: Date
lt_lt: Data

source: Status
lt_lt: Statusas

source: Check your email, we sent you an invoice. If you wish to use other methods for payment -
lt_lt: El. paštu Jums išsiuntėme išankstinę sąskaitą. Jei dar neapmokėjote ir norite pasirinkti kitą mokėjimo būdą -

source: Mistertango Payment Gateway
lt_lt: Mistertango mokėjimas

source: Enable/Disable
lt_lt: Įjungti/Išjungti

source: Enable Mister Tango Payment
lt_lt: Įjungti Mistertango mokėjimą

source: Title
lt_lt: Pavadinimas

source: Payment's title name.
lt_lt: Mokėjimo pavadinimas

source: Bank Transfer, Credit card and other
lt_lt: Banko mokėjimai, kortelės ir kiti

source: Description:
lt_lt: Aprašymas:

source: Description
lt_lt: Aprašymas

source: Payment's description
lt_lt: Mokėjimo aprašymas

source: Payments collected by Mistertango
lt_lt: Mokėjimus surenka Mistertango

source: Username
lt_lt: Vartotojo vardas

source: Username of Mistertango
lt_lt: Mistertango vartotojo vardas

source: Secret Key
lt_lt: Slaptas raktas

source: Secret Key Given to Merchant by Mistertango
lt_lt: Mistertango suteiktas slaptas raktas

source: Language
lt_lt: Kalba

source: Payment Window Language
lt_lt: Mokėjimo lango kalba
